## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.pomerium_sso_proxy must be replaced
-/+ resource "aws_ecs_service" "pomerium_sso_proxy" {
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/pomerium_sso_proxy/pomerium_sso_proxy" -> (known after apply)
        name                               = "pomerium_sso_proxy"
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer { # forces replacement
          - container_name   = "pomerium_sso_proxy" -> null
          - container_port   = 443 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/ecs/d4e6ecaa0c5ed62b" -> null
        }
      + load_balancer { # forces replacement
          + container_name   = "pomerium_sso_proxy"
          + container_port   = 443
          + target_group_arn = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_listener.https will be updated in-place
  ~ resource "aws_lb_listener" "https" {
        id                = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:listener/app/pomerium-sso/a3cb73cfad1e6ac8/736bf9bfaaed3686"
        tags              = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/ecs/d4e6ecaa0c5ed62b" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.ecs will be destroyed
  # (because aws_lb_target_group.ecs is not in configuration)
  - resource "aws_lb_target_group" "ecs" {
      - arn                                = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/ecs/d4e6ecaa0c5ed62b" -> null
      - arn_suffix                         = "targetgroup/ecs/d4e6ecaa0c5ed62b" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "30" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/ecs/d4e6ecaa0c5ed62b" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "ecs" -> null
      - port                               = 443 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-sso-proxy"
          - "Terraform"  = "true"
        } -> null
      - tags_all                           = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-sso-proxy"
          - "Terraform"  = "true"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-09a32d3e2e932fa09" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 30 -> null
          - matcher             = "200-399" -> null
          - path                = "/ping" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 10 -> null
          - unhealthy_threshold = 10 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # aws_lb_target_group.sso_proxy will be created
  + resource "aws_lb_target_group" "sso_proxy" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "ecs"
      + port                               = 443
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-sso-proxy"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-sso-proxy"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-09a32d3e2e932fa09"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/ping"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 10
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
